---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailConnectionOption
source: html/8cbeb5fd-2eab-c387-b499-869cedb44a19.htm
---
# Autodesk.Revit.DB.Architecture.RailConnectionOption

The connections between rails.

## Syntax (C#)
```csharp
public enum RailConnectionOption
```